Autodesk.Revit.DB.SolidCurveIntersectionOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.SolidCurveIntersectionOptions.ResultType
The type of results expected by the calculation.  The default is CurveSegmentsInside.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.SolidCurveIntersectionOptions.#ctor
Constructs a new SolidCurveIntersectionMode with default settings.
Since:
2013

Autodesk.Revit.DB.SolidCurveIntersectionOptions
This class contains the options used to calculate the intersection between a solid and a curve.
Since:
2013